{
  "architectures": [
    "NucTransformer"
  ],
  "d_model": 64,
  "dim_feedforward": 128,
  "dropout": 0.1,
  "max_len": 100,
  "model_type": "nucformer",
  "nhead": 4,
  "num_decoder_layers": 3,
  "num_encoder_layers": 3,
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "vocab_size": 6
}
